# Pandas for data analysis

Pandas is used for data analysis
Matplotlib is used for visualization

In [1]:
import numpy as np
import pandas as pd
import os

pandas reading a csv file. pd.read can also be used to read other types of files csv,tgt and others

In [2]:
student_performance= pd.read_csv("C:/performance/student.csv")
student_performance.head()      # shows the first five objects in your dataframe.

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [3]:
student_performance.info()    # shows the information of a dataframe i.e null values and non-null values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
gender                         1000 non-null object
race/ethnicity                 1000 non-null object
parental level of education    1000 non-null object
lunch                          1000 non-null object
test preparation course        1000 non-null object
math score                     1000 non-null int64
reading score                  1000 non-null int64
writing score                  1000 non-null int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [4]:
student_performance.describe()  # calculates for all numerical values in the dataframe.

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [5]:
total  = student_performance.sum(axis = 1)
print(total)

0      218
1      247
2      278
3      148
4      229
      ...
995    282
996    172
997    195
998    223
999    249
Length: 1000, dtype: int64

In [6]:
average_performance = total / 3
print(average_performance)

0      72.666667
1      82.333333
2      92.666667
3      49.333333
4      76.333333
         ...
995    94.000000
996    57.333333
997    65.000000
998    74.333333
999    83.000000
Length: 1000, dtype: float64

In [7]:
student_performance['Average_score'] = (student_performance['math score']+ student_performance['reading score']+student_performance['writing score'])/3

In [8]:
student_performance.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Average_score
0,female,group B,bachelor's degree,standard,none,72,72,74,72.666667
1,female,group C,some college,standard,completed,69,90,88,82.333333
2,female,group B,master's degree,standard,none,90,95,93,92.666667
3,male,group A,associate's degree,free/reduced,none,47,57,44,49.333333
4,male,group C,some college,standard,none,76,78,75,76.333333

In [9]:
test_preparation = student_performance['test preparation course'].map({'none':0 ,"completed":1})

In [10]:
student_performance.groupby('test preparation course')['writing score','math score','reading score'].mean()

                         writing score  math score  reading score
test preparation course
completed                    74.418994   69.695531      73.893855
none                         64.504673   64.077882      66.534268

In [11]:
test_preparation_df = test_preparation.to_frame()# changing series to a dataframe

In [12]:
test_preparation_df.to_csv("test_preparation_df.csv")

In [17]:
df1 = pd.read_csv('C:/Users/USER/test_preparation_df.csv')

In [18]:
preparation_course=pd.concat([df1 ,df2], axis =1)

TypeError: cannot concatenate object of type '<class 'str'>'; only Series and DataFrame objs are valid